bench/results/raw/proxy-20260917-210320/agensio_json-c64-r2.txt
Running 10s test @ http://127.0.0.1:8093/json
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   389.10us   76.05us   2.73ms   90.34%
    Req/Sec    41.35k     1.63k   44.04k    69.80%
  Latency Distribution
     50%  371.00us
     75%  390.00us
     90%  426.00us
     99%  734.00us
  1662017 requests in 10.10s, 242.51MB read
Requests/sec: 164564.45
Transfer/sec:     24.01MB